In [14]:
import pandas as pd
df = pd.read_csv('c:/users/rakesh/Desktop/Notes/PandasCode/student.csv')
print(df)

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

In [15]:
#add a row using append() function
row = {'name': 'ramji', 'english': 55, 'math': 66,
       'cs': 77, 'physics': 88, 'chemistry': 99}
df1= df.append(row,ignore_index=True)
print(df1)

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56
6   ramji       55    66  77       88         99

C:\Users\rakesh\AppData\Local\Temp\ipykernel_1576\520276126.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1= df.append(row,ignore_index=True)

In [16]:
#add new row using concate() function
newrow = [{'name': 'mukul', 'english': 99, 'math': 88,
          'cs': 77, 'physics': 66, 'chemistry': 55}]
df2= pd.DataFrame(newrow)
df2

    name  english  math  cs  physics  chemistry
0  mukul       99    88  77       66         55

In [17]:
#add new row using concat() function

df3= pd.concat([df1,df2],ignore_index=True)
df3

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56
6   ramji       55    66  77       88         99
7   mukul       99    88  77       66         55